In [2]:
import pandas as pd
#hay dos formas de realizar combinaciones = concatenacion y mezcla
#Concatenar por medio de filas
DF1 = pd.DataFrame({'NOMBRE':['Max','Juan'],
                    'CARRERA':['Mate','Fisica'],
                    'EDAD':[19,21]})
#indica cual sera el  indice del dataframe

In [6]:
#reglas para concatenar DF a partir de filas que los dataframes tengan el mismo indice de columnas
DF2 = pd.DataFrame({'NOMBRE':['pepe','mateo'],
                    'CARRERA':['POO','Progra'],
                    'EDAD':[22,35]}).set_index('NOMBRE')

In [7]:
DF1 = pd.DataFrame({'NOMBRE':['Max','Juan'],
                    'CARRERA':['Mate','Fisica'],
                    'EDAD':[19,21]}).set_index('NOMBRE')

In [11]:
#Concatenar dataframes
DF = pd.concat([DF1,DF2])

In [8]:
#Primer dataframe
DF1

       CARRERA  EDAD
NOMBRE
Max       Mate    19
Juan    Fisica    21

In [9]:
#Segundo dataframe
DF2

       CARRERA  EDAD
NOMBRE
pepe       POO    22
mateo   Progra    35

In [12]:
#concatenar dos dataframes
DF

       CARRERA  EDAD
NOMBRE
Max       Mate    19
Juan    Fisica    21
pepe       POO    22
mateo   Progra    35

In [18]:
#hay dos formas de realizar combinaciones = concatenacion y mezcla
#Concatenar por columnas
#REGLA Los dataframes combinados tengan el mismo indice de filas
Df1 = pd.DataFrame({'AUTOS':['nissan','ford','audio'],
                    'COLOR':['blanco','azul','rojo']}).set_index('AUTOS')
Df2 = pd.DataFrame ({'AUTOS':['nissan','ford','audio'],
                     'MODELO':[2018,2020,2022]}).set_index('AUTOS')

In [19]:
Df1

         COLOR
AUTOS
nissan  blanco
ford      azul
audio     rojo

In [20]:
Df2

        MODELO
AUTOS
nissan    2018
ford      2020
audio     2022

In [22]:
#axis  0 ES PARA FILAS Y 1 PARA COLUMNAS 
#SIRVE para tomar como referencia las columnas
df = pd.concat([Df1,Df2], axis = 1)
df

         COLOR  MODELO
AUTOS
nissan  blanco    2018
ford      azul    2020
audio     rojo    2022

In [27]:
#MEZCLA permite integrar filas de DOS datagrames que contienen informacion en comun
#en una o varias columnas mediante una CLAVE
df1 = pd.DataFrame({'AUTOS':['nissan','ford','audio'],
                    'COLOR':['blanco','azul','rojo']})
df2 = pd.DataFrame ({'AUTOS':['toyota','ford','audio'],
                     'MODELO':[2018,2020,2022]})

In [24]:
#con merge vamos a poder mezclar
dff = pd.merge(df1,df2, on='AUTOS') #si la informacion no es en comun se elimina la fila el dataframe
dff
#tomamos como referencia las filas
dff = pd.merge(df1,df2, on='AUTOS',how = 'outer')
#tomamos como referencia las columnas pero este viene por defecto
dff = pd.merge(df1,df2, on='AUTOS',how = 'inner')

    AUTOS   COLOR  MODELO
0  nissan  blanco    2018
1    ford    azul    2020
2   audio    rojo    2022

In [28]:
dff = pd.merge(df1,df2, on='AUTOS',how = 'outer')
dff

    AUTOS   COLOR  MODELO
0  nissan  blanco     NaN
1    ford    azul  2020.0
2   audio    rojo  2022.0
3  toyota     NaN  2018.0

In [29]:
# recoje datos del primer data frame
dff = pd.merge(df1,df2, on='AUTOS',how = 'left')
dff

    AUTOS   COLOR  MODELO
0  nissan  blanco     NaN
1    ford    azul  2020.0
2   audio    rojo  2022.0

In [30]:
# recoje datos del segundo data frame
dff = pd.merge(df1,df2, on='AUTOS',how = 'right')
dff

    AUTOS COLOR  MODELO
0  toyota   NaN    2018
1    ford  azul    2020
2   audio  rojo    2022